In [1]:
import pandas as pd
from sklearn.model_selection import train_test_split

In [2]:
pd.options.display.float_format = '{:.2f}'.format

In [3]:
dataset = pd.read_csv('../data/train.csv')
dataset.head()

,id,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,...,grade,sqft_above,sqft_basement,yr_built,yr_renovated,zipcode,lat,long,sqft_living15,sqft_lot15
0,5100402668,20150218T000000,495000.00,3,1.00,1570,5510,1.00,0,0,...,7,1070,500,1940,0,98115,47.69,-122.32,1770,6380
1,7856560480,20140808T000000,635000.00,3,2.50,1780,11000,1.00,0,0,...,8,1210,570,1980,0,98006,47.56,-122.15,2310,9700
2,2872900010,20150414T000000,382500.00,3,1.50,1090,9862,1.00,0,0,...,8,1090,0,1987,0,98074,47.63,-122.04,1710,9862
3,3216900070,20140617T000000,382500.00,4,2.50,2210,7079,2.00,0,0,...,8,2210,0,1993,0,98031,47.42,-122.18,1970,7000
4,976000790,20141020T000000,670000.00,3,2.50,1800,4763,2.00,0,0,...,7,1240,560,1985,0,98119,47.65,-122.36,1790,4763

In [4]:
nRow, nCol = dataset.shape

In [5]:
dataset[['bedrooms', 'price']].groupby(['bedrooms'], as_index=False).mean()

    bedrooms      price
0          0  360322.73
1          1  311169.75
2          2  400016.21
3          3  468444.78
4          4  639719.16
5          5  790536.14
6          6  862498.06
7          7 1007969.28
8          8 1226625.00
9          9  816799.80
10        10  819333.33
11        11  520000.00
12        33  640000.00

In [6]:
dataset.drop(columns=['id', 'date', 'condition', 'zipcode', 'long'], inplace=True)
dataset.head()

,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,grade,sqft_above,sqft_basement,yr_built,yr_renovated,lat,sqft_living15,sqft_lot15
0,495000.00,3,1.00,1570,5510,1.00,0,0,7,1070,500,1940,0,47.69,1770,6380
1,635000.00,3,2.50,1780,11000,1.00,0,0,8,1210,570,1980,0,47.56,2310,9700
2,382500.00,3,1.50,1090,9862,1.00,0,0,8,1090,0,1987,0,47.63,1710,9862
3,382500.00,4,2.50,2210,7079,2.00,0,0,8,2210,0,1993,0,47.42,1970,7000
4,670000.00,3,2.50,1800,4763,2.00,0,0,7,1240,560,1985,0,47.65,1790,4763